GopalSaraf/Practicals/PSDL/include/proc/pic18f2450.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0, a
#define ABDOVF                           BANKMASK(BAUDCON), 7, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define ACTVIE                           BANKMASK(UIE), 2, a
#define ACTVIF                           BANKMASK(UIR), 2, a
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN                            BANKMASK(RCSTA), 3, a
#define ADDR0                            BANKMASK(UADDR), 0, a
#define ADDR1                            BANKMASK(UADDR), 1, a
#define ADDR2                            BANKMASK(UADDR), 2, a
#define ADDR3                            BANKMASK(UADDR), 3, a
#define ADDR4                            BANKMASK(UADDR), 4, a
#define ADDR5                            BANKMASK(UADDR), 5, a
#define ADDR6                            BANKMASK(UADDR), 6, a
#define ADEN                             BANKMASK(RCSTA), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN10                             BANKMASK(PORTB), 1, a
#define AN11                             BANKMASK(PORTB), 4, a
#define AN12                             BANKMASK(PORTB), 0, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 5, a
#define AN8                              BANKMASK(PORTB), 2, a
#define AN9                              BANKMASK(PORTB), 3, a
#define BGST                             BANKMASK(HLVDCON), 5, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG16                            BANKMASK(BAUDCON), 3, a
#define BRGH                             BANKMASK(TXSTA), 2, a
#define BRGH1                            BANKMASK(TXSTA), 2, a
#define BTOEE                            BANKMASK(UEIE), 4, a
#define BTOEF                            BANKMASK(UEIR), 4, a
#define BTSEE                            BANKMASK(UEIE), 7, a
#define BTSEF                            BANKMASK(UEIR), 7, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CRC16EE                          BANKMASK(UEIE), 2, a
#define CRC16EF                          BANKMASK(UEIR), 2, a
#define CRC5EE                           BANKMASK(UEIE), 1, a
#define CRC5EF                           BANKMASK(UEIR), 1, a
#define CREN                             BANKMASK(RCSTA), 4, a
#define CSRC                             BANKMASK(TXSTA), 7, a
#define CSRC1                            BANKMASK(TXSTA), 7, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DFN8EE                           BANKMASK(UEIE), 3, a
#define DFN8EF                           BANKMASK(UEIR), 3, a
#define DIR                              BANKMASK(USTAT), 2, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT                               BANKMASK(PORTC), 7, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, a
#define EP0HSHK                          BANKMASK(UEP0), 4, a
#define EP0INEN                          BANKMASK(UEP0), 1, a
#define EP0OUTEN                         BANKMASK(UEP0), 2, a
#define EP0STALL                         BANKMASK(UEP0), 0, a
#define EP1CONDIS                        BANKMASK(UEP1), 3, a
#define EP1HSHK                          BANKMASK(UEP1), 4, a
#define EP1INEN                          BANKMASK(UEP1), 1, a
#define EP1OUTEN                         BANKMASK(UEP1), 2, a
#define EP1STALL                         BANKMASK(UEP1), 0, a
#define EP2CONDIS                        BANKMASK(UEP2), 3, a
#define EP2HSHK                          BANKMASK(UEP2), 4, a
#define EP2INEN                          BANKMASK(UEP2), 1, a
#define EP2OUTEN                         BANKMASK(UEP2), 2, a
#define EP2STALL                         BANKMASK(UEP2), 0, a
#define EP3CONDIS                        BANKMASK(UEP3), 3, a
#define EP3HSHK                          BANKMASK(UEP3), 4, a
#define EP3INEN                          BANKMASK(UEP3), 1, a
#define EP3OUTEN                         BANKMASK(UEP3), 2, a
#define EP3STALL                         BANKMASK(UEP3), 0, a
#define EP4CONDIS                        BANKMASK(UEP4), 3, a
#define EP4HSHK                          BANKMASK(UEP4), 4, a
#define EP4INEN                          BANKMASK(UEP4), 1, a
#define EP4OUTEN                         BANKMASK(UEP4), 2, a
#define EP4STALL                         BANKMASK(UEP4), 0, a
#define EP5CONDIS                        BANKMASK(UEP5), 3, a
#define EP5HSHK                          BANKMASK(UEP5), 4, a
#define EP5INEN                          BANKMASK(UEP5), 1, a
#define EP5OUTEN                         BANKMASK(UEP5), 2, a
#define EP5STALL                         BANKMASK(UEP5), 0, a
#define EP6CONDIS                        BANKMASK(UEP6), 3, a
#define EP6HSHK                          BANKMASK(UEP6), 4, a
#define EP6INEN                          BANKMASK(UEP6), 1, a
#define EP6OUTEN                         BANKMASK(UEP6), 2, a
#define EP6STALL                         BANKMASK(UEP6), 0, a
#define EP7CONDIS                        BANKMASK(UEP7), 3, a
#define EP7HSHK                          BANKMASK(UEP7), 4, a
#define EP7INEN                          BANKMASK(UEP7), 1, a
#define EP7OUTEN                         BANKMASK(UEP7), 2, a
#define EP7STALL                         BANKMASK(UEP7), 0, a
#define EPCONDIS0                        BANKMASK(UEP0), 3, a
#define EPCONDIS1                        BANKMASK(UEP1), 3, a
#define EPCONDIS10                       BANKMASK(UEP10), 3, a
#define EPCONDIS11                       BANKMASK(UEP11), 3, a
#define EPCONDIS12                       BANKMASK(UEP12), 3, a
#define EPCONDIS13                       BANKMASK(UEP13), 3, a
#define EPCONDIS14                       BANKMASK(UEP14), 3, a
#define EPCONDIS15                       BANKMASK(UEP15), 3, a
#define EPCONDIS2                        BANKMASK(UEP2), 3, a
#define EPCONDIS3                        BANKMASK(UEP3), 3, a
#define EPCONDIS4                        BANKMASK(UEP4), 3, a
#define EPCONDIS5                        BANKMASK(UEP5), 3, a
#define EPCONDIS6                        BANKMASK(UEP6), 3, a
#define EPCONDIS7                        BANKMASK(UEP7), 3, a
#define EPCONDIS8                        BANKMASK(UEP8), 3, a
#define EPCONDIS9                        BANKMASK(UEP9), 3, a
#define EPHSHK0                          BANKMASK(UEP0), 4, a
#define EPHSHK1                          BANKMASK(UEP1), 4, a
#define EPHSHK10                         BANKMASK(UEP10), 4, a
#define EPHSHK11                         BANKMASK(UEP11), 4, a
#define EPHSHK12                         BANKMASK(UEP12), 4, a
#define EPHSHK13                         BANKMASK(UEP13), 4, a
#define EPHSHK14                         BANKMASK(UEP14), 4, a
#define EPHSHK15                         BANKMASK(UEP15), 4, a
#define EPHSHK2                          BANKMASK(UEP2), 4, a
#define EPHSHK3                          BANKMASK(UEP3), 4, a
#define EPHSHK4                          BANKMASK(UEP4), 4, a
#define EPHSHK5                          BANKMASK(UEP5), 4, a
#define EPHSHK6                          BANKMASK(UEP6), 4, a
#define EPHSHK7                          BANKMASK(UEP7), 4, a
#define EPHSHK8                          BANKMASK(UEP8), 4, a
#define EPHSHK9                          BANKMASK(UEP9), 4, a
#define EPINEN0                          BANKMASK(UEP0), 1, a
#define EPINEN1                          BANKMASK(UEP1), 1, a
#define EPINEN10                         BANKMASK(UEP10), 1, a
#define EPINEN11                         BANKMASK(UEP11), 1, a
#define EPINEN12                         BANKMASK(UEP12), 1, a
#define EPINEN13                         BANKMASK(UEP13), 1, a
#define EPINEN14                         BANKMASK(UEP14), 1, a
#define EPINEN15                         BANKMASK(UEP15), 1, a
#define EPINEN2                          BANKMASK(UEP2), 1, a
#define EPINEN3                          BANKMASK(UEP3), 1, a
#define EPINEN4                          BANKMASK(UEP4), 1, a
#define EPINEN5                          BANKMASK(UEP5), 1, a
#define EPINEN6                          BANKMASK(UEP6), 1, a
#define EPINEN7                          BANKMASK(UEP7), 1, a
#define EPINEN8                          BANKMASK(UEP8), 1, a
#define EPINEN9                          BANKMASK(UEP9), 1, a
#define EPOUTEN0                         BANKMASK(UEP0), 2, a
#define EPOUTEN1                         BANKMASK(UEP1), 2, a
#define EPOUTEN10                        BANKMASK(UEP10), 2, a
#define EPOUTEN11                        BANKMASK(UEP11), 2, a
#define EPOUTEN12                        BANKMASK(UEP12), 2, a
#define EPOUTEN13                        BANKMASK(UEP13), 2, a
#define EPOUTEN14                        BANKMASK(UEP14), 2, a
#define EPOUTEN15                        BANKMASK(UEP15), 2, a
#define EPOUTEN2                         BANKMASK(UEP2), 2, a
#define EPOUTEN3                         BANKMASK(UEP3), 2, a
#define EPOUTEN4                         BANKMASK(UEP4), 2, a
#define EPOUTEN5                         BANKMASK(UEP5), 2, a
#define EPOUTEN6                         BANKMASK(UEP6), 2, a
#define EPOUTEN7                         BANKMASK(UEP7), 2, a
#define EPOUTEN8                         BANKMASK(UEP8), 2, a
#define EPOUTEN9                         BANKMASK(UEP9), 2, a
#define EPSTALL0                         BANKMASK(UEP0), 0, a
#define EPSTALL1                         BANKMASK(UEP1), 0, a
#define EPSTALL10                        BANKMASK(UEP10), 0, a
#define EPSTALL11                        BANKMASK(UEP11), 0, a
#define EPSTALL12                        BANKMASK(UEP12), 0, a
#define EPSTALL13                        BANKMASK(UEP13), 0, a
#define EPSTALL14                        BANKMASK(UEP14), 0, a
#define EPSTALL15                        BANKMASK(UEP15), 0, a
#define EPSTALL2                         BANKMASK(UEP2), 0, a
#define EPSTALL3                         BANKMASK(UEP3), 0, a
#define EPSTALL4                         BANKMASK(UEP4), 0, a
#define EPSTALL5                         BANKMASK(UEP5), 0, a
#define EPSTALL6                         BANKMASK(UEP6), 0, a
#define EPSTALL7                         BANKMASK(UEP7), 0, a
#define EPSTALL8                         BANKMASK(UEP8), 0, a
#define EPSTALL9                         BANKMASK(UEP9), 0, a
#define FERR                             BANKMASK(RCSTA), 2, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FRM0                             BANKMASK(UFRML), 0, a
#define FRM1                             BANKMASK(UFRML), 1, a
#define FRM10                            BANKMASK(UFRMH), 2, a
#define FRM2                             BANKMASK(UFRML), 2, a
#define FRM3                             BANKMASK(UFRML), 3, a
#define FRM4                             BANKMASK(UFRML), 4, a
#define FRM5                             BANKMASK(UFRML), 5, a
#define FRM6                             BANKMASK(UFRML), 6, a
#define FRM7                             BANKMASK(UFRML), 7, a
#define FRM8                             BANKMASK(UFRMH), 0, a
#define FRM9                             BANKMASK(UFRMH), 1, a
#define FSEN                             BANKMASK(UCFG), 2, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIN                           BANKMASK(PORTA), 5, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define IDLEIE                           BANKMASK(UIE), 4, a
#define IDLEIF                           BANKMASK(UIR), 4, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTB), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTB), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTB), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define IVRST                            BANKMASK(HLVDCON), 5, a
#define KBI0                             BANKMASK(PORTB), 4, a
#define KBI1                             BANKMASK(PORTB), 5, a
#define KBI2                             BANKMASK(PORTB), 6, a
#define KBI3                             BANKMASK(PORTB), 7, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LVDEN                            BANKMASK(HLVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIN                            BANKMASK(PORTA), 5, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(HLVDCON), 0, a
#define LVDL1                            BANKMASK(HLVDCON), 1, a
#define LVDL2                            BANKMASK(HLVDCON), 2, a
#define LVDL3                            BANKMASK(HLVDCON), 3, a
#define LVV0                             BANKMASK(HLVDCON), 0, a
#define LVV1                             BANKMASK(HLVDCON), 1, a
#define LVV2                             BANKMASK(HLVDCON), 2, a
#define LVV3                             BANKMASK(HLVDCON), 3, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_IPEN                         BANKMASK(RCON), 7, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_UOE                          BANKMASK(PORTC), 1, a
